class Area < ActiveHash::Base
    self.data = [
      { id: 1, name: '--' },
      { id: 2, name: '丸の内・大手町・八重洲' },
      { id: 3, name: '銀座・有楽町・日比谷' },
      { id: 4, name: '新橋・汐留' },
      { id: 5, name: '神谷町・麻布台・御成門・愛宕' },
      { id: 6, name: '芝公園・芝・赤羽橋・三田' },
      { id: 7, name: '浜松町・竹芝・芝浦' },
      { id: 8, name: '品川・大崎・五反田・天王洲' },
      { id: 9, name: '日本橋・京橋' },
      { id: 10, name: '築地・月島・勝どき・晴海' },
      { id: 11, name: '台場・有明・豊洲・新木場' },
      { id: 12, name: '上野・浅草・蔵前・御徒町' },
      { id: 13, name: '浅草橋・両国・森下' },
      { id: 14, name: '押上・曳舟・向島' },
      { id: 15, name: '神田・秋葉原・お茶の水' },
      { id: 16, name: '神楽坂・飯田橋・江戸川橋' },
      { id: 17, name: '四谷・市ヶ谷・麹町・半蔵門' },
      { id: 18, name: '赤坂・永田町・溜池山王・虎ノ門' },
      { id: 19, name: '六本木・西麻布・麻布十番' },
      { id: 20, name: '広尾・天現寺・南麻布・元麻布' },
      { id: 21, name: '白金・高輪・四の橋' },
      { id: 22, name: '恵比寿・渋谷区東' },
      { id: 23, name: '青山・外苑前・乃木坂' },
      { id: 24, name: '原宿・表参道・神宮前' },
      { id: 25, name: '渋谷・松濤・神泉' },
      { id: 26, name: '代々木・千駄ヶ谷' },
      { id: 27, name: '新宿' },
      { id: 28, name: '富ヶ谷・代々木上原・下北沢' },
      { id: 29, name: '代官山' },
      { id: 30, name: '中目黒' },
      { id: 31, name: '目黒・学芸大学・祐天寺' },
      { id: 32, name: '池尻・三宿・駒沢・三軒茶屋' },
      { id: 33, name: '初台・幡ヶ谷・笹塚・代田橋' },
      { id: 34, name: '門前仲町・木場・清澄白河' },
      { id: 35, name: '高田馬場・目白・池袋' },
      { id: 36, name: '茅場町・八丁堀・新川' },
      { id: 37, name: '人形町・浜町・馬喰町' },
      { id: 38, name: '神保町・九段下・水道橋' },
      { id: 39, name: '自由が丘・都立大学' },
      { id: 40, name: 'その他' }
    ]

    include ActiveHash::Associations
    has_many :foods

end